In [18]:
import os

In [19]:
#!pip install mysql-connector

In [20]:
#!pip uninstall mysql-connector

In [21]:
#!pip install mysql-connector-python

In [22]:
import mysql.connector

In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [24]:
user_name=os.environ.get('DB_USER')
password=os.environ.get('DB_PASS')

In [25]:
connection=mysql.connector.connect(host='localhost', user="root",password="harinhk",database='imdb',auth_plugin='mysql_native_password')

In [26]:
connection

In [27]:
#DML means data manipulation language #insert, update and delete are DML commands

In [28]:
#DDL commands
#Create, alter, drop, truncate ,rename, truncate, rename

In [29]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)
#estudent table is in row index 3

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3          estudent
4        helloworld
5            movies
6  movies_directors
7     movies_genres
8             roles
9           student

In [30]:
#pd.read_sql_query("DELETE FROM estudent", connection)
#this command deletes all the data from estudent table

In [31]:
#TRUNCATE table student. This is a DDL command, this can't be reverted back. all the space for student is removed
#delete is DML command

In [32]:
#difference between truncate, delete and drop
#drop means whole table is dropeed
#truncate means table structure still remains

In [33]:
pd.read_sql_query("SHOW databases", connection)

             Database
0                 db1
1                 db2
2                imdb
3  information_schema
4               mysql
5         mysqljigsaw
6  performance_schema
7              sakila
8                 sys
9               world

In [34]:
#pd.read_sql_query("USE imdb", connection)

In [35]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3          estudent
4        helloworld
5            movies
6  movies_directors
7     movies_genres
8             roles
9           student

In [36]:
pd.read_sql_query("SELECT * FROM actors", connection)

            id     first_name           last_name gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
817713  845461         Herdís      Þorvaldsdóttir      F
817714  845462  Katla Margrét      Þorvaldsdóttir      F
817715  845463     Lilja Nótt      Þórarinsdóttir      F
817716  845464     Hólmfríður      Þórhallsdóttir      F
817717  845465       Theódóra        Þórðardóttir      F

[817718 rows x 4 columns]

In [37]:
pd.read_sql_query("SELECT * FROM roles", connection)

         actor_id  movie_id              role
0               2    280088            Stevie
1               2    396232  Various/lyricist
2               3    376687          Gitano 1
3               4    336265         El Cigala
4               5    135644           Himself
...           ...       ...               ...
3431961    845461    137097              Kata
3431962    845462    208838             Magga
3431963    845463       870             Gunna
3431964    845464    378123            Gudrun
3431965    845465    378123

[3431966 rows x 3 columns]

In [38]:
#clauses in sql
#IN means exact match
#BETWEEN means range matching
#LIKE means for pattern matching

In [39]:
pd.read_sql_query("SELECT first_name, gender from actors WHERE first_name='Michael'", connection)

     first_name gender
0       Michael      M
1       Michael      M
2       Michael      M
3       Michael      M
4       Michaël      M
...         ...    ...
4017    Michael      F
4018    Michael      F
4019    Michael      F
4020    Michael      F
4021    Michael      F

[4022 rows x 2 columns]

In [40]:
pd.read_sql_query("SELECT actor_id, movie_id, role from roles WHERE role='kata' OR role='Magga' or role='Gunna'", connection)

    actor_id  movie_id   role
0     144881    187263   Kata
1     236085    153379  Gunna
2     478440    113126   Kata
3     562435    183998  Magga
4     568608     39052   Kata
5     621666    322005   Kata
6     626800     43114   Kata
7     630794    314759  Magga
8     630968    390721   Kata
9     632393    192778   Kata
10    642326    182526   Káta
11    642996    174103  Magga
12    644989    322099   Kata
13    655692    182525   Káta
14    659510    134635   Kata
15    679516    259421  Gunna
16    707165    222441   Kata
17    713183    154294  Gunna
18    729866    177120   Kata
19    732634    343707   Kata
20    746599    357793   Kata
21    755964    175635   Kata
22    768405    156566   Kata
23    777676    211038   Kata
24    808184    226001   Kata
25    812991    378049  Magga
26    818709    171598   Kata
27    826552    268266   Káta
28    827628    270714   Kata
29    827728    409099   Kata
30    845461    137097   Kata
31    845462    208838  Magga
32    845463       870  Gunna

In [41]:
pd.read_sql_query("SELECT actor_id, movie_id, role from roles WHERE role in ('kata', 'Magga', 'Gunna')", connection)

    actor_id  movie_id   role
0     144881    187263   Kata
1     236085    153379  Gunna
2     478440    113126   Kata
3     562435    183998  Magga
4     568608     39052   Kata
5     621666    322005   Kata
6     626800     43114   Kata
7     630794    314759  Magga
8     630968    390721   Kata
9     632393    192778   Kata
10    642326    182526   Káta
11    642996    174103  Magga
12    644989    322099   Kata
13    655692    182525   Káta
14    659510    134635   Kata
15    679516    259421  Gunna
16    707165    222441   Kata
17    713183    154294  Gunna
18    729866    177120   Kata
19    732634    343707   Kata
20    746599    357793   Kata
21    755964    175635   Kata
22    768405    156566   Kata
23    777676    211038   Kata
24    808184    226001   Kata
25    812991    378049  Magga
26    818709    171598   Kata
27    826552    268266   Káta
28    827628    270714   Kata
29    827728    409099   Kata
30    845461    137097   Kata
31    845462    208838  Magga
32    845463       870  Gunna

In [42]:
pd.read_sql_query("SELECT actor_id, movie_id, role from roles WHERE role in ('kata', 'Magga', 'Gunna') AND movie_id=270714", connection)

   actor_id  movie_id  role
0    827628    270714  Kata

In [43]:
pd.read_sql_query("SELECT * FROM movies", connection)

            id                                 name  year  rankscore
0            0                                  #28  2002        NaN
1            1  #7 Train: An Immigrant Journey, The  2000        NaN
2            2                                    $  1971        6.4
3            3                        $1,000 Reward  1913        NaN
4            4                        $1,000 Reward  1915        NaN
...        ...                                  ...   ...        ...
388264  412316                      "zem blch krlu"  1991        NaN
388265  412317                             "rgammk"  1995        NaN
388266  412318                         "zgnm Leyla"  2002        NaN
388267  412319                          " Istanbul"  1983        NaN
388268  412320                          "sterreich"  1958        NaN

[388269 rows x 4 columns]

In [44]:
pd.read_sql_query("SELECT year, rankscore FROM movies WHERE year>=2002 and year<=2005", connection)

       year  rankscore
0      2002        NaN
1      2002        NaN
2      2004        NaN
3      2002        5.4
4      2002        6.8
...     ...        ...
34108  2003        NaN
34109  2003        NaN
34110  2004        NaN
34111  2002        NaN
34112  2002        NaN

[34113 rows x 2 columns]

In [45]:
pd.read_sql_query("SELECT year, rankscore FROM movies WHERE year BETWEEN 2002 AND 2003", connection) 
#this command same as above

       year  rankscore
0      2002        NaN
1      2002        NaN
2      2002        5.4
3      2002        6.8
4      2002        NaN
...     ...        ...
23941  2002        NaN
23942  2003        NaN
23943  2003        NaN
23944  2002        NaN
23945  2002        NaN

[23946 rows x 2 columns]

In [46]:
pd.read_sql_query("SELECT year, rankscore FROM movies WHERE year BETWEEN 2002 AND 2003 AND name ='#28'", connection)

   year rankscore
0  2002      None

In [47]:
pd.read_sql_query("SELECT role from roles WHERE role like 'Karl%'", connection)

                               role
0                        Karl Meyer
1                              Karl
2                      Karl Stevens
3                              Karl
4                          Karlsson
...                             ...
1819  Karls Zimmerfrau Frau Zierbar
1820                          Karla
1821                          Karla
1822                          Karla
1823                 Karls Freundin

[1824 rows x 1 columns]

In [48]:
pd.read_sql_query("SELECT role from roles WHERE role like '%arla'", connection)

            role
0          Karla
1    Tommy Tarla
2          Carla
3          Carla
4          Carla
..           ...
664        Karla
665        Marla
666        Karla
667        Carla
668        Karla

[669 rows x 1 columns]

In [49]:
#name of roles that comprises atleast one a
pd.read_sql_query("SELECT role from roles WHERE role like '%a%'", connection)

                          role
0             Various/lyricist
1                     Gitano 1
2                    El Cigala
3        Staff Humorist (1996)
4              Amigo Cigala #2
...                        ...
1613651                  Lilja
1613652                  Malín
1613653                   Kata
1613654                  Magga
1613655                  Gunna

[1613656 rows x 1 columns]

In [50]:
#name of roles that comprises atleast two a's
pd.read_sql_query("SELECT role from roles WHERE role like '%a%a%'", connection)

                                 role
0                           El Cigala
1                     Amigo Cigala #2
2       Segundo Cuadro Flamenco 'Tang
3                Chavo Banda Galerias
4       Tercer Cuadro Flamenco 'Solea
...                               ...
649203                        Sanieba
649204                  Tanja Lohhoff
649205                           Lára
649206                           Kata
649207                          Magga

[649208 rows x 1 columns]

In [51]:
#name of roles that comprises atleast three a's
pd.read_sql_query("SELECT role from roles WHERE role like '%a%a%a%'", connection)

                                 role
0                     Amigo Cigala #2
1       Segundo Cuadro Flamenco 'Tang
2                Chavo Banda Galerias
3       Tercer Cuadro Flamenco 'Solea
4        Froilán plaza del estudiante
...                               ...
193220               Dilara Hamzaoðlu
193221                 Madre de yaman
193222               Laura, hans kone
193223           Lena, Kona til Oscar
193224                        Barbara

[193225 rows x 1 columns]

In [52]:
#all roles where certain number of characters
#name of roles that comprises atleast 10 characters: so kept 10 underscores
pd.read_sql_query("SELECT role from roles WHERE role like '__________'", connection)

              role
0       Victoriano
1       Themselves
2       Themselves
3       Themselves
4       Themselves
...            ...
129613  Jenny Lind
129614  Fru Hambro
129615  Miss Riege
129616  Kontordame
129617  Bernadette

[129618 rows x 1 columns]

In [53]:
#name of roles that comprises second letter as a and fourth letter as a
pd.read_sql_query("SELECT role from roles WHERE role like '_a_a%'", connection)

                     role
0       Karate Contestant
1      Managers assistant
2              Vacationer
3           Sakari Urpela
4               Paramedic
...                   ...
32797          Samatulayz
32798        Hasan's wife
32799               Sarah
32800                Lára
32801                Kata

[32802 rows x 1 columns]

In [54]:
#value of NULL at any cell means undetermined value
#Arithmetic operation on any null value also returns NULL value
#NULL value in table is not the same as 0

In [55]:
pd.read_sql_query("SELECT role from roles WHERE role IS null", connection)

Empty DataFrame
Columns: [role]
Index: []

In [56]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore is null", connection)

            id                                 name  year rankscore
0            0                                  #28  2002      None
1            1  #7 Train: An Immigrant Journey, The  2000      None
2            3                        $1,000 Reward  1913      None
3            4                        $1,000 Reward  1915      None
4            5                        $1,000 Reward  1923      None
...        ...                                  ...   ...       ...
321019  412316                      "zem blch krlu"  1991      None
321020  412317                             "rgammk"  1995      None
321021  412318                         "zgnm Leyla"  2002      None
321022  412319                          " Istanbul"  1983      None
321023  412320                          "sterreich"  1958      None

[321024 rows x 4 columns]

In [57]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore = null", connection) #this won't work

Empty DataFrame
Columns: [id, name, year, rankscore]
Index: []

In [58]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore is not null", connection)

           id                  name  year  rankscore
0           2                     $  1971        6.4
1           6       $1,000,000 Duck  1971        5.0
2          11     $1000 a Touchdown  1939        6.7
3          15                   $30  1999        7.5
4          18               $40,000  1996        9.6
...       ...                   ...   ...        ...
67240  378558  berleben in New York  1989        6.9
67241  378583             vegtigris  2001        8.7
67242  378596                Kagiti  1981        8.2
67243  378610              nc sayfa  1999        7.0
67244  378614               . 19,99  1998        6.3

[67245 rows x 4 columns]

In [59]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE rankscore is null", connection)

   count(*)
0    321024

In [60]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE rankscore is not null", connection)

   count(*)
0     67245

In [61]:
pd.read_sql_query("SELECT count(*) from roles WHERE role IS null", connection)

   count(*)
0         0

In [62]:
pd.read_sql_query("SELECT count(*) from roles WHERE role IS NOT null", connection)

   count(*)
0   3431966

In [63]:
pd.read_sql_query("SELECT * FROM movies ORDER BY year", connection) #default order is ascending

            id                                       name  year  rankscore
0       337409              Traffic Crossing Leeds Bridge  1888        NaN
1       282455                      Roundhay Garden Scene  1888        NaN
2       218186                        Monkeyshines, No. 1  1890        7.3
3       218187                        Monkeyshines, No. 2  1890        NaN
4       218188                        Monkeyshines, No. 3  1890        NaN
...        ...                                        ...   ...        ...
388264  347931                 Untitled Star Trek Prequel  2007        NaN
388265  339929                                    Tripoli  2007        NaN
388266  139654  Harry Potter and the Order of the Phoenix  2007        NaN
388267  359289                  War of the Red Cliff, The  2007        NaN
388268  139653     Harry Potter and the Half-Blood Prince  2008        NaN

[388269 rows x 4 columns]

In [64]:
pd.read_sql_query("SELECT * FROM movies ORDER BY year DESC", connection)

            id                                       name  year  rankscore
0       139653     Harry Potter and the Half-Blood Prince  2008        NaN
1       139654  Harry Potter and the Order of the Phoenix  2007        NaN
2       359289                  War of the Red Cliff, The  2007        NaN
3       311040                               Spider-Man 3  2007        NaN
4        92850                               DragonBall Z  2007        NaN
...        ...                                        ...   ...        ...
388264  218186                        Monkeyshines, No. 1  1890        7.3
388265  218187                        Monkeyshines, No. 2  1890        NaN
388266  218188                        Monkeyshines, No. 3  1890        NaN
388267  282455                      Roundhay Garden Scene  1888        NaN
388268  337409              Traffic Crossing Leeds Bridge  1888        NaN

[388269 rows x 4 columns]

In [65]:
pd.read_sql_query("SELECT * FROM movies ORDER BY name, year", connection) #ORDER BY on multiple columns
#first it will sort by first column and then by second column

,id,name,year,rankscore
0,376764,173 St.G.B. Blutschande,1929,NaN
1,376765,51 StGB,1915,NaN
2,377603,a Maior,1958,NaN
3,378606,apkin gelin,1961,NaN
4,378592,arkadas,1958,NaN
...,...,...,...,...
388264,376567,Zzracny hlavolam,1967,NaN
388265,376546,Zzyzx,2004,NaN
388266,376547,Zzzzzzzzzz: John Doel Portrait of a Sleepologist,2004,NaN
388267,3315,[E]vangelion,2005,NaN
388268,3316,[Insert Title Here],2000,NaN

In [66]:
pd.read_sql_query("SELECT * FROM movies ORDER BY name DESC, year", connection) #ORDER BY on multiple columns

,id,name,year,rankscore
0,3316,[Insert Title Here],2000,NaN
1,3315,[E]vangelion,2005,NaN
2,376547,Zzzzzzzzzz: John Doel Portrait of a Sleepologist,2004,NaN
3,376546,Zzyzx,2004,NaN
4,376567,Zzracny hlavolam,1967,NaN
...,...,...,...,...
388264,378593,arkadas,1971,NaN
388265,378606,apkin gelin,1961,NaN
388266,377603,a Maior,1958,NaN
388267,376765,51 StGB,1915,NaN
388268,376764,173 St.G.B. Blutschande,1929,NaN

In [67]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY name DESC, year DESC", connection) #ORDER BY on multiple columns

                                                    name  year
0                                    [Insert Title Here]  2000
1                                           [E]vangelion  2005
2       Zzzzzzzzzz: John Doel Portrait of a Sleepologist  2004
3                                                  Zzyzx  2004
4                                       Zzracny hlavolam  1967
...                                                  ...   ...
388264                                           arkadas  1958
388265                                       apkin gelin  1961
388266                                           a Maior  1958
388267                                           51 StGB  1915
388268                           173 St.G.B. Blutschande  1929

[388269 rows x 2 columns]

In [68]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY year DESC, name DESC", connection) #ORDER BY on multiple columns

                                          name  year
0       Harry Potter and the Half-Blood Prince  2008
1                    War of the Red Cliff, The  2007
2                   Untitled Star Trek Prequel  2007
3                                      Tripoli  2007
4                                 Spider-Man 3  2007
...                                        ...   ...
388264                     Monkeyshines, No. 3  1890
388265                     Monkeyshines, No. 2  1890
388266                     Monkeyshines, No. 1  1890
388267           Traffic Crossing Leeds Bridge  1888
388268                   Roundhay Garden Scene  1888

[388269 rows x 2 columns]

In [69]:
    pd.read_sql_query("SELECT name, year FROM movies ORDER BY year DESC, name", connection) #ORDER BY on multiple columns

                                             name  year
0          Harry Potter and the Half-Blood Prince  2008
1                                    DragonBall Z  2007
2       Harry Potter and the Order of the Phoenix  2007
3                              Rapunzel Unbraided  2007
4                                    Spider-Man 3  2007
...                                           ...   ...
388264                        Monkeyshines, No. 1  1890
388265                        Monkeyshines, No. 2  1890
388266                        Monkeyshines, No. 3  1890
388267                      Roundhay Garden Scene  1888
388268              Traffic Crossing Leeds Bridge  1888

[388269 rows x 2 columns]

In [70]:
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year DESC", connection) 
#first WHERE is executed and then ORDER BY is executed

                                              name  year
0                           "Aarresaaren sankarit"  2003
1  Fahrradfahrer oder 'Schrders Leidenschaft', Der  1996
2                                     Fahrrad, Das  1967
3                                Bairro Salazar, O  1965
4                                Bairros Populares  1960
5                                    Bairro Blgica  1937
6                     Bairro Operrio de Vila Viosa  1937

In [71]:
pd.read_sql_query("SELECT name, year FROM movies LIMIT 5", connection) 
#limits the number of records

                                  name  year
0                                  #28  2002
1  #7 Train: An Immigrant Journey, The  2000
2                                    $  1971
3                        $1,000 Reward  1913
4                        $1,000 Reward  1915

In [72]:
pd.read_sql_query("SELECT name, year FROM movies LIMIT 2, 5", connection) 
#from 2nd row it is selecting 5

              name  year
0                $  1971
1    $1,000 Reward  1913
2    $1,000 Reward  1915
3    $1,000 Reward  1923
4  $1,000,000 Duck  1971

In [73]:
pd.read_sql_query("SELECT name, year FROM movies LIMIT 0, 5", connection)

                                  name  year
0                                  #28  2002
1  #7 Train: An Immigrant Journey, The  2000
2                                    $  1971
3                        $1,000 Reward  1913
4                        $1,000 Reward  1915

In [74]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY year DESC LIMIT 1", connection) #ORDER BY on multiple columns

                                     name  year
0  Harry Potter and the Half-Blood Prince  2008

In [75]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY year LIMIT 3", connection) #ORDER BY on multiple columns

                            name  year
0          Roundhay Garden Scene  1888
1  Traffic Crossing Leeds Bridge  1888
2            Monkeyshines, No. 3  1890

In [76]:
#select clause and where clause are working in conjunction
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year DESC LIMIT 1", connection)

                     name  year
0  "Aarresaaren sankarit"  2003

In [77]:
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year LIMIT 3", connection)

                           name  year
0                 Bairro Blgica  1937
1  Bairro Operrio de Vila Viosa  1937
2             Bairros Populares  1960

In [78]:
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year LIMIT 1, 1", connection) 
#last but one selection

                           name  year
0  Bairro Operrio de Vila Viosa  1937

In [79]:
#case statements
pd.read_sql_query("SET @number=10", connection)

TypeError: 'NoneType' object is not iterable

In [ ]:
pd.read_sql_query("SELECT case(@number%2) when 0 then 'even' when 1 then 'odd' end", connection)

In [ ]:
pd.read_sql_query("SET @number=11", connection)

In [ ]:
pd.read_sql_query("SELECT case(@number%2) when 0 then 'even' when 1 then 'odd' end", connection)

In [ ]:
pd.read_sql_query("SELECT case(@number%2) when 0 then 'even' when 1 then 'odd' end as numbertype", connection)

In [ ]:
#kata magga
pd.read_sql_query("SELECT * FROM movies", connection)

In [ ]:
pd.read_sql_query("SELECT name, year, rankscore, case(year) when 1971 then rankscore+2 when 2008 then rankscore-1 else rankscore end as normrankscore FROM movies", connection)

In [ ]:
pd.read_sql_query("SELECT name, year, rankscore FROM movies", connection) 
#we haven't updated the table, above command just displays the modification but won't changes any thing inside the database

In [ ]:
pd.read_sql_query("SELECT * FROM actors", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, gender, case(gender) when 'M' then concat('Mr ', first_name) when 'F' then concat('Mrs ', first_name) end FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, gender, case(gender) when 'M' then concat('Mr ', first_name) when 'F' then concat('Mrs ', first_name) end as new_firstname FROM actors ", connection)

In [ ]:
#single row functions

In [ ]:
pd.read_sql_query("SELECT length('nhk')", connection)

In [ ]:
pd.read_sql_query("SELECT upper('nhk')", connection)

In [ ]:
pd.read_sql_query("SELECT lower('NHK')", connection)

In [ ]:
pd.read_sql_query("SELECT substring('nhkempire', 2, 4)", connection)

In [ ]:
pd.read_sql_query("SELECT instr('nhkempire', 'e')", connection)

In [ ]:
pd.read_sql_query("SELECT instr('nhkempire', 'k')", connection)

In [ ]:
pd.read_sql_query("SELECT concat('nhk', ' empire')", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, length(first_name) FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, upper(first_name) FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, last_name, concat(first_name, last_name) as full_name FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, last_name, concat(first_name, concat(' ', last_name)) as full_name FROM actors ", connection)

In [ ]:
#converting all the first letters of first_name to lower case letters
pd.read_sql_query("SELECT first_name, substring(first_name, 2, 1) FROM actors ", connection) 
#start from 2 and only get 1 character

In [ ]:
pd.read_sql_query("SELECT first_name, lower(substring(first_name, 2, 1)) as lowersecond FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, concat(lower(substring(first_name, 2, 1)), substring(first_name,3,length(first_name))) as lowersecond FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, concat(concat(upper(substring(first_name, 1, 1)), '.'), substring(first_name, instr(first_name, ' '))) as sname FROM actors", connection)

In [80]:
#finding middle element of a string and printing it
pd.read_sql_query("SELECT first_name, case(length(first_name)%2) when 0 then substring(first_name, length(first_name)/2,2) when 1 then substring(first_name, length(first_name)/2,1) end as middle FROM actors", connection)

             first_name middle
0                !Nqate     qa
1           'Agent' Ava      t
2       'Amarillo Slim'      l
3           'Angry' Joe      y
4         'Arm' Suvinit      S
...                 ...    ...
817713           Þórður      u
817714           Þráinn     in
817715          Þröstur      t
817716      Þröstur Leó     r
817717           Þrúður      u

[817718 rows x 2 columns]

In [81]:
pd.read_sql_query("SELECT ltrim('   nhk')", connection)

  ltrim('   nhk')
0             nhk

In [82]:
pd.read_sql_query("SELECT repeat('*',10)", connection)

  repeat('*',10)
0     **********

In [83]:
pd.read_sql_query("SHOW TABLES FROM IMDB", connection)
#imdb also working

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3          estudent
4        helloworld
5            movies
6  movies_directors
7     movies_genres
8             roles
9           student

In [84]:
pd.read_sql_query("SELECT * FROM estudent", connection)

Empty DataFrame
Columns: [sno, sname, age, marks, subject]
Index: []

In [85]:
pd.read_sql_query("INSERT INTO estudent values(1,'        nhk',24,98,'mths')", connection)

TypeError: 'NoneType' object is not iterable

In [86]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno        sname  age  marks subject
0    1          nhk   24     98    mths

In [87]:
pd.read_sql_query("INSERT INTO estudent values(2,'  nhk1',24,98,'mths')", connection)

TypeError: 'NoneType' object is not iterable

In [88]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno        sname  age  marks subject
0    1          nhk   24     98    mths
1    2         nhk1   24     98    mths

In [89]:
pd.read_sql_query("SELECT sname, length(sname)-length(ltrim(sname)) from estudent", connection)

         sname  length(sname)-length(ltrim(sname))
0          nhk                                   8
1         nhk1                                   2

In [90]:
pd.read_sql_query("SELECT sname, repeat('*',length(sname)-length(ltrim(sname))) from estudent", connection)

         sname repeat('*',length(sname)-length(ltrim(sname)))
0          nhk                                       ********
1         nhk1                                             **

In [91]:
pd.read_sql_query("SELECT sname, length(sname)-length(ltrim(sname)), concat(repeat('*',length(sname)-length(ltrim(sname))), ltrim(sname)) from estudent", connection)

,sname,length(sname)-length(ltrim(sname)),"concat(repeat('*',length(sname)-length(ltrim(sname))), ltrim(sname))"
0,nhk,8,********nhk
1,nhk1,2,**nhk1

In [92]:
pd.read_sql_query("SELECT replace('nhk','h','H')", connection)
#this is another way of doing the same thing

  replace('nhk','h','H')
0                    nHk

In [93]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno        sname  age  marks subject
0    1          nhk   24     98    mths
1    2         nhk1   24     98    mths

In [94]:
pd.read_sql_query("INSERT INTO estudent values(1,'nhk',244434,98,'mths')", connection)

TypeError: 'NoneType' object is not iterable

In [95]:
pd.read_sql_query("INSERT INTO estudent values(2,'nhk1',24443434,98,'mths')", connection)

TypeError: 'NoneType' object is not iterable

In [97]:
pd.read_sql_query("SELECT age, length(age)-4 FROM estudent", connection)

        age  length(age)-4
0        24             -2
1        24             -2
2    244434              2
3  24443434              4

In [98]:
pd.read_sql_query("SELECT age, repeat('X',length(age)-4) FROM estudent", connection)

        age repeat('X',length(age)-4)
0        24
1        24
2    244434                        XX
3  24443434                      XXXX

In [99]:
pd.read_sql_query("SELECT age, repeat('X',length(age)-4), substring(age, length(age)-4,length(age)) FROM estudent", connection)

,age,"repeat('X',length(age)-4)","substring(age, length(age)-4,length(age))"
0,24,,24
1,24,,24
2,244434,XX,44434
3,24443434,XXXX,43434

In [100]:
pd.read_sql_query("SELECT age, concat(repeat('X',length(age)-4), substring(age, length(age)-4,length(age))) as maskedage FROM estudent", connection)

        age  maskedage
0        24         24
1        24         24
2    244434    XX44434
3  24443434  XXXX43434

In [101]:
pd.read_sql_query("SELECT timestampdiff(month,'2013-03-14','2014-05-23')", connection)

   timestampdiff(month,'2013-03-14','2014-05-23')
0                                              14

In [102]:
pd.read_sql_query("SELECT timestampdiff(day,'2013-03-14','2014-05-23')", connection)

   timestampdiff(day,'2013-03-14','2014-05-23')
0                                           435

In [103]:
pd.read_sql_query("SELECT timestampdiff(year,'2013-03-14','2014-05-23')", connection)

   timestampdiff(year,'2013-03-14','2014-05-23')
0                                              1

In [104]:
pd.read_sql_query("SELECT * FROM movies", connection)

            id                                 name  year  rankscore
0            0                                  #28  2002        NaN
1            1  #7 Train: An Immigrant Journey, The  2000        NaN
2            2                                    $  1971        6.4
3            3                        $1,000 Reward  1913        NaN
4            4                        $1,000 Reward  1915        NaN
...        ...                                  ...   ...        ...
388264  412316                      "zem blch krlu"  1991        NaN
388265  412317                             "rgammk"  1995        NaN
388266  412318                         "zgnm Leyla"  2002        NaN
388267  412319                          " Istanbul"  1983        NaN
388268  412320                          "sterreich"  1958        NaN

[388269 rows x 4 columns]

In [105]:
pd.read_sql_query("SELECT *, timestampdiff(month, year, curdate()) as yearpassed FROM movies", connection)

,id,name,year,rankscore,yearpassed
0,0,#28,2002,NaN,None
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,None
2,2,$,1971,6.4,None
3,3,"$1,000 Reward",1913,NaN,None
4,4,"$1,000 Reward",1915,NaN,None
...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,None
388265,412317,"""rgammk""",1995,NaN,None
388266,412318,"""zgnm Leyla""",2002,NaN,None
388267,412319,""" Istanbul""",1983,NaN,None
388268,412320,"""sterreich""",1958,NaN,None

In [106]:
pd.read_sql_query("SELECT *, timestampdiff(month, year, curdate()) as yearpassed, if(timestampdiff(month, year, curdate())>=1, year+1, year) as newyear FROM movies", connection)

,id,name,year,rankscore,yearpassed,newyear
0,0,#28,2002,NaN,None,2002
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,None,2000
2,2,$,1971,6.4,None,1971
3,3,"$1,000 Reward",1913,NaN,None,1913
4,4,"$1,000 Reward",1915,NaN,None,1915
...,...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,None,1991
388265,412317,"""rgammk""",1995,NaN,None,1995
388266,412318,"""zgnm Leyla""",2002,NaN,None,2002
388267,412319,""" Istanbul""",1983,NaN,None,1983
388268,412320,"""sterreich""",1958,NaN,None,1958

In [107]:
pd.read_sql_query("SELECT quarter(curdate())", connection)

   quarter(curdate())
0                   2

In [108]:
pd.read_sql_query("SELECT dayname(curdate())", connection)

  dayname(curdate())
0             Sunday

In [109]:
pd.read_sql_query("SELECT case(dayname(curdate())) when 'Sunday' then 'weekend' when 'Saturday' then 'weekend' else 'weekday' end as dayofweek", connection)

  dayofweek
0   weekend

In [110]:
pd.read_sql_query("SELECT extract(month from curdate())", connection)

   extract(month from curdate())
0                              5

In [111]:
pd.read_sql_query("SELECT extract(year from curdate())", connection)

   extract(year from curdate())
0                          2020

In [113]:
pd.read_sql_query("SELECT STR_TO_DATE('04/31/2004', '%m/%d/%Y')", connection)

  STR_TO_DATE('04/31/2004', '%m/%d/%Y')
0                                  None

In [114]:
pd.read_sql_query("SELECT STR_TO_DATE('August 10 2017', '%M %d %Y')", connection)

  STR_TO_DATE('August 10 2017', '%M %d %Y')
0                                2017-08-10

In [115]:
pd.read_sql_query("SELECT STR_TO_DATE('August,5,2017', '%M,%e,%Y')", connection)

  STR_TO_DATE('August,5,2017', '%M,%e,%Y')
0                               2017-08-05

In [122]:
pd.read_sql_query("SELECT STR_TO_DATE('August,5,17', '%M,%e,%y')", connection)

  STR_TO_DATE('August,5,17', '%M,%e,%y')
0                             2017-08-05

In [124]:
pd.read_sql_query("SELECT STR_TO_DATE('5,17,August', '%e,%y,%M')", connection)

  STR_TO_DATE('5,17,August', '%e,%y,%M')
0                             2017-08-05

In [116]:
pd.read_sql_query("SELECT STR_TO_DATE('Monday, August 14, 2017', '%W, %M %e, %Y')", connection)

  STR_TO_DATE('Monday, August 14, 2017', '%W, %M %e, %Y')
0                                         2017-08-14

In [121]:
pd.read_sql_query("SELECT STR_TO_DATE('Monday, August 14, 17', '%W, %M %e, %y')", connection)

  STR_TO_DATE('Monday, August 14, 17', '%W, %M %e, %y')
0                                         2017-08-14

In [117]:
pd.read_sql_query("SELECT STR_TO_DATE('August 5 2017', '%M %e %Y')", connection)

  STR_TO_DATE('August 5 2017', '%M %e %Y')
0                               2017-08-05

In [120]:
pd.read_sql_query("SELECT STR_TO_DATE('August 5 17', '%M %e %y')", connection)

  STR_TO_DATE('August 5 17', '%M %e %y')
0                             2017-08-05

In [123]:
pd.read_sql_query("SELECT STR_TO_DATE('5 17 August', '%e %y %M')", connection)

  STR_TO_DATE('5 17 August', '%e %y %M')
0                             2017-08-05

In [118]:
pd.read_sql_query("SELECT STR_TO_DATE('2017,8,14 10,40,10', '%Y,%m,%d %h,%i,%s')", connection)

  STR_TO_DATE('2017,8,14 10,40,10', '%Y,%m,%d %h,%i,%s')
0                                2017-08-14 10:40:10

In [119]:
pd.read_sql_query("SELECT STR_TO_DATE('17,8,14 10,40,10', '%y,%m,%d %h,%i,%s')", connection)

  STR_TO_DATE('17,8,14 10,40,10', '%y,%m,%d %h,%i,%s')
0                                2017-08-14 10:40:10

In [125]:
pd.read_sql_query("SELECT * FROM movies", connection)

            id                                 name  year  rankscore
0            0                                  #28  2002        NaN
1            1  #7 Train: An Immigrant Journey, The  2000        NaN
2            2                                    $  1971        6.4
3            3                        $1,000 Reward  1913        NaN
4            4                        $1,000 Reward  1915        NaN
...        ...                                  ...   ...        ...
388264  412316                      "zem blch krlu"  1991        NaN
388265  412317                             "rgammk"  1995        NaN
388266  412318                         "zgnm Leyla"  2002        NaN
388267  412319                          " Istanbul"  1983        NaN
388268  412320                          "sterreich"  1958        NaN

[388269 rows x 4 columns]

In [126]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore is null", connection)

            id                                 name  year rankscore
0            0                                  #28  2002      None
1            1  #7 Train: An Immigrant Journey, The  2000      None
2            3                        $1,000 Reward  1913      None
3            4                        $1,000 Reward  1915      None
4            5                        $1,000 Reward  1923      None
...        ...                                  ...   ...       ...
321019  412316                      "zem blch krlu"  1991      None
321020  412317                             "rgammk"  1995      None
321021  412318                         "zgnm Leyla"  2002      None
321022  412319                          " Istanbul"  1983      None
321023  412320                          "sterreich"  1958      None

[321024 rows x 4 columns]

In [127]:
pd.read_sql_query("SELECT ifnull(3,4)", connection)

   ifnull(3,4)
0            3

In [129]:
pd.read_sql_query("SELECT ifnull(NULL,4)", connection)
#this is singular function

   ifnull(NULL,4)
0               4

In [130]:
pd.read_sql_query("SELECT id, name, year, rankscore, rankscore+1 FROM movies", connection)

,id,name,year,rankscore,rankscore+1
0,0,#28,2002,NaN,NaN
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,NaN
2,2,$,1971,6.4,7.4
3,3,"$1,000 Reward",1913,NaN,NaN
4,4,"$1,000 Reward",1915,NaN,NaN
...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,NaN
388265,412317,"""rgammk""",1995,NaN,NaN
388266,412318,"""zgnm Leyla""",2002,NaN,NaN
388267,412319,""" Istanbul""",1983,NaN,NaN
388268,412320,"""sterreich""",1958,NaN,NaN

In [131]:
pd.read_sql_query("SELECT id, name, year, rankscore, ifnull(rankscore,0)+1 FROM movies", connection)

,id,name,year,rankscore,"ifnull(rankscore,0)+1"
0,0,#28,2002,NaN,1.0
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,1.0
2,2,$,1971,6.4,7.4
3,3,"$1,000 Reward",1913,NaN,1.0
4,4,"$1,000 Reward",1915,NaN,1.0
...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,1.0
388265,412317,"""rgammk""",1995,NaN,1.0
388266,412318,"""zgnm Leyla""",2002,NaN,1.0
388267,412319,""" Istanbul""",1983,NaN,1.0
388268,412320,"""sterreich""",1958,NaN,1.0

In [133]:
pd.read_sql_query("SELECT if(2>1,'aaa','bbb')", connection)

  if(2>1,'aaa','bbb')
0                 aaa

In [137]:
pd.read_sql_query("SELECT id, name, year, rankscore, ifnull(rankscore,0)+1, if(rankscore is null, 'rankscore-1', 'rankscore') FROM movies", connection)

,id,name,year,rankscore,"ifnull(rankscore,0)+1","if(rankscore is null, 'rankscore-1', 'rankscore')"
0,0,#28,2002,NaN,1.0,rankscore-1
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,1.0,rankscore-1
2,2,$,1971,6.4,7.4,rankscore
3,3,"$1,000 Reward",1913,NaN,1.0,rankscore-1
4,4,"$1,000 Reward",1915,NaN,1.0,rankscore-1
...,...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,1.0,rankscore-1
388265,412317,"""rgammk""",1995,NaN,1.0,rankscore-1
388266,412318,"""zgnm Leyla""",2002,NaN,1.0,rankscore-1
388267,412319,""" Istanbul""",1983,NaN,1.0,rankscore-1
388268,412320,"""sterreich""",1958,NaN,1.0,rankscore-1

In [138]:
pd.read_sql_query("SELECT id, name, year, rankscore, ifnull(rankscore,0)+1 as random, if(rankscore is null, 'rankscore-1', 'rankscore') as effective FROM movies", connection)

,id,name,year,rankscore,random,effective
0,0,#28,2002,NaN,1.0,rankscore-1
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,1.0,rankscore-1
2,2,$,1971,6.4,7.4,rankscore
3,3,"$1,000 Reward",1913,NaN,1.0,rankscore-1
4,4,"$1,000 Reward",1915,NaN,1.0,rankscore-1
...,...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,1.0,rankscore-1
388265,412317,"""rgammk""",1995,NaN,1.0,rankscore-1
388266,412318,"""zgnm Leyla""",2002,NaN,1.0,rankscore-1
388267,412319,""" Istanbul""",1983,NaN,1.0,rankscore-1
388268,412320,"""sterreich""",1958,NaN,1.0,rankscore-1

In [139]:
#Group functions
pd.read_sql_query("SELECT name, upper(name) FROM movies", connection)

,name,upper(name)
0,173 St.G.B. Blutschande,173 ST.G.B. BLUTSCHANDE
1,51 StGB,51 STGB
2,a Maior,A MAIOR
3,apkin gelin,APKIN GELIN
4,arkadas,ARKADAS
...,...,...
388264,Zzracny hlavolam,ZZRACNY HLAVOLAM
388265,Zzyzx,ZZYZX
388266,Zzzzzzzzzz: John Doel Portrait of a Sleepologist,ZZZZZZZZZZ: JOHN DOEL PORTRAIT OF A SLEEPOLOGIST
388267,[E]vangelion,[E]VANGELION
388268,[Insert Title Here],[INSERT TITLE HERE]

In [140]:
pd.read_sql_query("SELECT name, upper(name), length(name) FROM movies", connection)

,name,upper(name),length(name)
0,173 St.G.B. Blutschande,173 ST.G.B. BLUTSCHANDE,24
1,51 StGB,51 STGB,8
2,a Maior,A MAIOR,8
3,apkin gelin,APKIN GELIN,12
4,arkadas,ARKADAS,8
...,...,...,...
388264,Zzracny hlavolam,ZZRACNY HLAVOLAM,16
388265,Zzyzx,ZZYZX,5
388266,Zzzzzzzzzz: John Doel Portrait of a Sleepologist,ZZZZZZZZZZ: JOHN DOEL PORTRAIT OF A SLEEPOLOGIST,48
388267,[E]vangelion,[E]VANGELION,12
388268,[Insert Title Here],[INSERT TITLE HERE],19

In [142]:
#this is a group function
pd.read_sql_query("SELECT count(*) FROM movies", connection)

   count(*)
0    388269

In [143]:
pd.read_sql_query("SELECT sum(length(name)) FROM movies", connection)

   sum(length(name))
0          7108147.0

In [144]:
pd.read_sql_query("SELECT max(length(name)) FROM movies", connection)

   max(length(name))
0                100

In [145]:
pd.read_sql_query("SELECT min(length(name)) FROM movies", connection)

   min(length(name))
0                  1

In [146]:
pd.read_sql_query("SELECT avg(length(name)) FROM movies", connection)

   avg(length(name))
0            18.3073

In [147]:
pd.read_sql_query("SELECT max(length(name)) as maxlength, min(length(name)) as minlength, avg(length(name)) as avglength  FROM movies", connection)

   maxlength  minlength  avglength
0        100          1    18.3073

In [152]:
pd.read_sql_query("SELECT max(length(name)) FROM movies WHERE name like 'Z%'", connection)

   max(length(name))
0                100

In [151]:
pd.read_sql_query("SELECT max(length(name)) FROM movies WHERE name like 'Zz%'", connection)

   max(length(name))
0                 48

In [153]:
#group functions are evaluated after where clause (after filetering of rows which is done by where clause)

In [154]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE length(name) between 40 and 50", connection)

   count(*)
0      8668

In [155]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE length(name) between 30 and 40", connection)

   count(*)
0     27545

In [156]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE length(name) between 20 and 30", connection)

   count(*)
0    103004

In [161]:
#group functions do not operate on null values
pd.read_sql_query("SELECT count(rankscore) FROM movies", connection)

   count(rankscore)
0             67245

In [160]:
pd.read_sql_query("SELECT count(*) FROM movies", connection)

   count(*)
0    388269

In [164]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE rankscore is null", connection)
#it will exclude null values from rankscore when

   count(*)
0    321024

In [165]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE year=2002", connection)

   count(*)
0     12056

In [166]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE year=2008", connection)

   count(*)
0         1

In [167]:
pd.read_sql_query("SELECT count(DISTINCT id, rankscore) FROM movies", connection)

   count(DISTINCT id, rankscore)
0                          67245

In [168]:
pd.read_sql_query("SELECT * FROM actors", connection)

            id     first_name           last_name gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
817713  845461         Herdís      Þorvaldsdóttir      F
817714  845462  Katla Margrét      Þorvaldsdóttir      F
817715  845463     Lilja Nótt      Þórarinsdóttir      F
817716  845464     Hólmfríður      Þórhallsdóttir      F
817717  845465       Theódóra        Þórðardóttir      F

[817718 rows x 4 columns]

In [169]:
pd.read_sql_query("SELECT count(*) FROM actors WHERE gender='M'", connection)

   count(*)
0    513306

In [170]:
pd.read_sql_query("SELECT count(*) FROM actors WHERE gender='F'", connection)

   count(*)
0    304412

In [171]:
pd.read_sql_query("SELECT sum(case(gender) when 'M' then 1 else 0 end) as males, sum(case(gender) when 'F' then 1 else 0 end) as females FROM actors", connection)

      males   females
0  513306.0  304412.0

In [173]:
pd.read_sql_query("SELECT sum(case(year) when 2002 then 1 else 0 end) as '2002', sum(case(year) when 2003 then 1 else 0 end) as '2003', sum(case(year) when 2004 then 1 else 0 end) as '2004', sum(case(year) when 2005 then 1 else 0 end) as '2005' FROM movies", connection)

      2002     2003    2004    2005
0  12056.0  11890.0  8718.0  1449.0

In [175]:
#Group by clause
#it is different from group functions
#group functions can't be implemented inside where clause

In [176]:
pd.read_sql_query("SELECT max(length(name)) FROM movies WHERE name like 'Zz%'", connection)

   max(length(name))
0                 48

In [177]:
pd.read_sql_query("SELECT sum(length(name)) FROM movies WHERE name like 'Zz%'", connection)

   sum(length(name))
0              267.0

In [178]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE name like 'Zz%'", connection)

   count(*)
0        17

In [179]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE name like 'Xx%'", connection)

   count(*)
0        30

In [184]:
pd.read_sql_query("SELECT count(*), year FROM movies group by year", connection)

     count(*)  year
0       12056  2002
1       11643  2000
2        4072  1971
3        3690  1913
4        3722  1915
..        ...   ...
115         7  2007
116         6  1891
117         1  2008
118         3  1890
119         2  1888

[120 rows x 2 columns]

In [182]:
pd.read_sql_query("SELECT count(*), year FROM movies group by year LIMIT 10", connection)

   count(*)  year
0     12056  2002
1     11643  2000
2      4072  1971
3      3690  1913
4      3722  1915
5      1759  1923
6      2308  1920
7      2041  1921
8     11690  2001
9      1996  1939

In [183]:
pd.read_sql_query("SELECT DISTINCT year from movies", connection)

     year
0    2002
1    2000
2    1971
3    1913
4    1915
..    ...
115  2007
116  1891
117  2008
118  1890
119  1888

[120 rows x 1 columns]

In [185]:
pd.read_sql_query("SELECT * FROM movies order by year", connection)

            id                                       name  year  rankscore
0       337409              Traffic Crossing Leeds Bridge  1888        NaN
1       282455                      Roundhay Garden Scene  1888        NaN
2       218186                        Monkeyshines, No. 1  1890        7.3
3       218187                        Monkeyshines, No. 2  1890        NaN
4       218188                        Monkeyshines, No. 3  1890        NaN
...        ...                                        ...   ...        ...
388264  347931                 Untitled Star Trek Prequel  2007        NaN
388265  339929                                    Tripoli  2007        NaN
388266  139654  Harry Potter and the Order of the Phoenix  2007        NaN
388267  359289                  War of the Red Cliff, The  2007        NaN
388268  139653     Harry Potter and the Half-Blood Prince  2008        NaN

[388269 rows x 4 columns]

In [186]:
pd.read_sql_query("SELECT * FROM movies order by year desc", connection)

            id                                       name  year  rankscore
0       139653     Harry Potter and the Half-Blood Prince  2008        NaN
1       139654  Harry Potter and the Order of the Phoenix  2007        NaN
2       359289                  War of the Red Cliff, The  2007        NaN
3       311040                               Spider-Man 3  2007        NaN
4        92850                               DragonBall Z  2007        NaN
...        ...                                        ...   ...        ...
388264  218186                        Monkeyshines, No. 1  1890        7.3
388265  218187                        Monkeyshines, No. 2  1890        NaN
388266  218188                        Monkeyshines, No. 3  1890        NaN
388267  282455                      Roundhay Garden Scene  1888        NaN
388268  337409              Traffic Crossing Leeds Bridge  1888        NaN

[388269 rows x 4 columns]

In [187]:
#first groupings are performed and on those groups group functions are applied

In [191]:
pd.read_sql_query("SELECT year, max(rankscore) FROM movies group by year", connection)

     year  max(rankscore)
0    2002             9.9
1    2000             9.9
2    1971             9.9
3    1913             8.8
4    1915             9.1
..    ...             ...
115  2007             NaN
116  1891             4.3
117  2008             NaN
118  1890             7.3
119  1888             NaN

[120 rows x 2 columns]

In [190]:
pd.read_sql_query("SELECT year, max(rankscore) FROM movies group by year order by year desc", connection)

     year  max(rankscore)
0    2008             NaN
1    2007             NaN
2    2006             NaN
3    2005             NaN
4    2004             9.9
..    ...             ...
115  1893             6.8
116  1892             5.1
117  1891             4.3
118  1890             7.3
119  1888             NaN

[120 rows x 2 columns]

In [192]:
pd.read_sql_query("SELECT year, max(rankscore), min(rankscore), avg(rankscore) FROM movies group by year order by year desc", connection)

     year  max(rankscore)  min(rankscore)  avg(rankscore)
0    2008             NaN             NaN             NaN
1    2007             NaN             NaN             NaN
2    2006             NaN             NaN             NaN
3    2005             NaN             NaN             NaN
4    2004             9.9             1.0        6.217399
..    ...             ...             ...             ...
115  1893             6.8             6.8        6.800000
116  1892             5.1             1.4        2.866667
117  1891             4.3             3.2        3.683333
118  1890             7.3             7.3        7.300000
119  1888             NaN             NaN             NaN

[120 rows x 4 columns]

In [194]:
pd.read_sql_query("SELECT year, max(rankscore) as maxrankscore, min(rankscore) as minrankscore, avg(rankscore) as avgrankscore FROM movies group by year order by year desc", connection)

     year  maxrankscore  minrankscore  avgrankscore
0    2008           NaN           NaN           NaN
1    2007           NaN           NaN           NaN
2    2006           NaN           NaN           NaN
3    2005           NaN           NaN           NaN
4    2004           9.9           1.0      6.217399
..    ...           ...           ...           ...
115  1893           6.8           6.8      6.800000
116  1892           5.1           1.4      2.866667
117  1891           4.3           3.2      3.683333
118  1890           7.3           7.3      7.300000
119  1888           NaN           NaN           NaN

[120 rows x 4 columns]

In [197]:
pd.read_sql_query("SELECT year, length(name), max(rankscore) as maxrankscore, min(rankscore) as minrankscore, avg(rankscore) as avgrankscore FROM movies group by length(name)", connection)

    year  length(name)  maxrankscore  minrankscore  avgrankscore
0   2002             3           9.8           1.2      6.169630
1   2000            35           9.7           1.0      5.699653
2   1971             1           8.5           2.9      6.348148
3   1913            13           9.9           1.0      5.797582
4   1971            15           9.8           1.0      5.879516
..   ...           ...           ...           ...           ...
93  1923            91           NaN           NaN           NaN
94  2001            85           4.2           2.4      3.300000
95  1900            97           NaN           NaN           NaN
96  1900            98           NaN           NaN           NaN
97  1900            99           NaN           NaN           NaN

[98 rows x 5 columns]

In [198]:
pd.read_sql_query("SELECT year, count(*) from movies group by year", connection)

     year  count(*)
0    2002     12056
1    2000     11643
2    1971      4072
3    1913      3690
4    1915      3722
..    ...       ...
115  2007         7
116  1891         6
117  2008         1
118  1890         3
119  1888         2

[120 rows x 2 columns]

In [200]:
pd.read_sql_query("SELECT year, count(*) from movies group by year order by year desc", connection)

     year  count(*)
0    2008         1
1    2007         7
2    2006       195
3    2005      1449
4    2004      8718
..    ...       ...
115  1893         2
116  1892         9
117  1891         6
118  1890         3
119  1888         2

[120 rows x 2 columns]

In [201]:
#Group functions are executed after execution of where clause

In [204]:
pd.read_sql_query("SELECT year, count(*) from movies WHERE year in (2002, 2003, 2004, 2005) group by year", connection)

   year  count(*)
0  2002     12056
1  2004      8718
2  2003     11890
3  2005      1449

In [203]:
pd.read_sql_query("SELECT year, count(*) from movies WHERE year in (2002, 2003, 2004, 2005) group by year order by year desc", connection)

   year  count(*)
0  2005      1449
1  2004      8718
2  2003     11890
3  2002     12056

In [214]:
# order of functioning is 1) where 2) group by 3) group functions 4) having 5) order by

In [206]:
# group functions can't be written inside where clause

In [207]:
pd.read_sql_query("SELECT year, rankscore, count(*) from movies WHERE year in (2002, 2003, 2004, 2005) group by year order by year desc", connection)
#not a valid query

   year rankscore  count(*)
0  2005      None      1449
1  2004      None      8718
2  2003      None     11890
3  2002      None     12056

In [208]:
#only the columns mentioned in the group by clause can be selected using the select clause

In [210]:
pd.read_sql_query("SELECT year, count(*) from movies group by year having count(*)<100", connection)

   year  count(*)
0  1895        72
1  1894        59
2  1893         2
3  1892         9
4  2007         7
5  1891         6
6  2008         1
7  1890         3
8  1888         2

In [213]:
pd.read_sql_query("SELECT year, count(*) as yrcnt from movies group by year having yrcnt=1", connection)

   year  yrcnt
0  2008      1

In [212]:
pd.read_sql_query("SELECT year, count(*) from movies group by year having count(*)=1", connection)

   year  count(*)
0  2008         1

In [216]:
pd.read_sql_query("SELECT year, count(*) from movies WHERE year in (2002, 2003, 2004, 2005) group by year having count(*) < 10000 order by year desc", connection)

   year  count(*)
0  2005      1449
1  2004      8718

In [218]:
#Primary key constraint
#used to uniquely identify each row in a table
#primary key must contain unique and NOT NULL values

In [219]:
pd.read_sql_query("SELECT * FROM estudent", connection)

Empty DataFrame
Columns: [sno, sname, age, marks, subject]
Index: []

In [220]:
pd.read_sql_query("desc estudent", connection)

     Field          Type Null Key         Default Extra
0      sno       int(11)  YES                None
1    sname   varchar(20)  YES                None
2      age       int(11)  YES                None
3    marks       int(11)  YES                None
4  subject  varchar(100)   NO      thermodynamics

In [221]:
pd.read_sql_query("ALTER TABLE estudent add constraint sno_estudent_pk primary key(sno)", connection)

TypeError: 'NoneType' object is not iterable

In [223]:
pd.read_sql_query("desc estudent", connection)
#now null of sno changed to NO from YES (means it became primary key)

     Field          Type Null  Key         Default Extra
0      sno       int(11)   NO  PRI            None
1    sname   varchar(20)  YES                 None
2      age       int(11)  YES                 None
3    marks       int(11)  YES                 None
4  subject  varchar(100)   NO       thermodynamics

In [230]:
pd.read_sql_query("INSERT INTO estudent values(1,'nhk',24,98,'mths')", connection)

TypeError: 'NoneType' object is not iterable

In [231]:
pd.read_sql_query("INSERT INTO estudent values(2,'nhk1',25,93,'mths1')", connection)

TypeError: 'NoneType' object is not iterable

In [232]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno sname  age  marks subject
0    1   nhk   24     98    mths
1    2  nhk1   25     93   mths1

In [233]:
#if i try to add same value in primary key it will give error
pd.read_sql_query("INSERT INTO estudent values(1,'nhk3',25,93,'mths1')", connection)

DatabaseError: Execution failed on sql 'INSERT INTO estudent values(1,'nhk3',25,93,'mths1')': 1062 (23000): Duplicate entry '1' for key 'PRIMARY'

In [234]:
pd.read_sql_query("SELECT * FROM estudent", connection)

Empty DataFrame
Columns: [sno, sname, age, marks, subject]
Index: []

In [235]:
#dropping a primary key
pd.read_sql_query("ALTER table estudent drop primary key", connection)

TypeError: 'NoneType' object is not iterable

In [236]:
pd.read_sql_query("DESC estudent", connection)
#now sno is not primary key

     Field          Type Null Key         Default Extra
0      sno       int(11)   NO                None
1    sname   varchar(20)  YES                None
2      age       int(11)  YES                None
3    marks       int(11)  YES                None
4  subject  varchar(100)   NO      thermodynamics

In [238]:
#to add two combination of two columns as primary key
# like movie and release year are combinely depict primary key

In [239]:
pd.read_sql_query("ALTER TABLE estudent add constraint sno_sname_estudent_pk primary key(sno, sname)", connection)

TypeError: 'NoneType' object is not iterable

In [241]:
pd.read_sql_query("DESC estudent", connection)
#We can have only one primary key. (in this case sno and sname combination is primary key and not two primary keys)

     Field          Type Null  Key         Default Extra
0      sno       int(11)   NO  PRI            None
1    sname   varchar(20)   NO  PRI            None
2      age       int(11)  YES                 None
3    marks       int(11)  YES                 None
4  subject  varchar(100)   NO       thermodynamics

In [242]:
pd.read_sql_query("DESC information_schema.key_column_usage", connection)

                            Field              Type Null Key Default Extra
0              CONSTRAINT_CATALOG       varchar(64)  YES        None
1               CONSTRAINT_SCHEMA       varchar(64)  YES        None
2                 CONSTRAINT_NAME       varchar(64)   NO        None
3                   TABLE_CATALOG       varchar(64)  YES        None
4                    TABLE_SCHEMA       varchar(64)  YES        None
5                      TABLE_NAME       varchar(64)  YES        None
6                     COLUMN_NAME       varchar(64)  YES        None
7                ORDINAL_POSITION  int(10) unsigned   NO        None
8   POSITION_IN_UNIQUE_CONSTRAINT         binary(0)  YES        None
9         REFERENCED_TABLE_SCHEMA         binary(0)  YES        None
10          REFERENCED_TABLE_NAME         binary(0)  YES        None
11         REFERENCED_COLUMN_NAME         binary(0)  YES        None

In [243]:
pd.read_sql_query("SELECT COLUMN_NAME, CONSTRAINT_NAME, TABLE_NAME, TABLE_SCHEMA from information_schema.key_column_usage WHERE TABLE_NAME='estudent' and TABLE_SCHEMA='imdb'", connection)
#TABLE_SCHEMA is current database

  COLUMN_NAME CONSTRAINT_NAME TABLE_NAME TABLE_SCHEMA
0         sno         PRIMARY   estudent         imdb
1       sname         PRIMARY   estudent         imdb

In [245]:
#NOT NULL constraint
#this forces a values in a column to be not null

In [247]:
pd.read_sql_query("DESC estudent", connection)

     Field          Type Null  Key         Default Extra
0      sno       int(11)   NO  PRI            None
1    sname   varchar(20)   NO  PRI            None
2      age       int(11)  YES                 None
3    marks       int(11)  YES                 None
4  subject  varchar(100)   NO       thermodynamics

In [248]:
pd.read_sql_query("ALTER TABLE estudent change age age int(11) not null", connection)

TypeError: 'NoneType' object is not iterable

In [249]:
pd.read_sql_query("DESC estudent", connection)
#age variable NULL changed to NO, as we changed the constraint

     Field          Type Null  Key         Default Extra
0      sno       int(11)   NO  PRI            None
1    sname   varchar(20)   NO  PRI            None
2      age       int(11)   NO                 None
3    marks       int(11)  YES                 None
4  subject  varchar(100)   NO       thermodynamics

In [250]:
pd.read_sql_query("ALTER TABLE estudent change marks marks int(11) not null default 0", connection)

TypeError: 'NoneType' object is not iterable

In [251]:
pd.read_sql_query("DESC estudent", connection)
#defaulst and not null both changed. check from previous version

     Field          Type Null  Key         Default Extra
0      sno       int(11)   NO  PRI            None
1    sname   varchar(20)   NO  PRI            None
2      age       int(11)   NO                 None
3    marks       int(11)   NO                    0
4  subject  varchar(100)   NO       thermodynamics

In [254]:
#Foreign key constraint
#it is a parent child kind of constraint
# parent can't be deleted if child exists
# it points primary key of another key
# it is used to maintain refential integrity